package 概括;
/**
 *    数组的复制与扩容
 *  数组变量的复制，是并不会复制数组对象，是两个变量引用了同一个数组对象。
 *  数组的复制的本质是创建了新数组，将原数组的内容复制过来。
 *  扩容：创建新数组，新数组容量大于原数组，将原数组内容复制到新数组，并且丢弃原数组，
 *       简单说：就是更换更大的数组对象
 *  java API:StringBuilder ArrayList HashMap ByteArrayOutputStream
 * 		 字符串连接运算
 * 排序呢算法:目的是多多练习for 和 数组操作
 * 会冒泡排序:比较相邻元素，大的向后交换
 * Arrays 数组工具类
 * 
 * 递归调用: 方法中调用了方法本身
 *    递归解决问题:简练只需考虑一层逻辑即可！但是需要有经验。
 *            一定要有结束条件！递归层次不能太深
 *    总之:慎用递归！
 * 
 * 二进制基础
 *     1.计算机一切数据都是2进制的！基本类型，对象，音频，视频
 * 	   2.10进制是人类习惯，计算按照人类习惯利用算法输入输出
 *       “10” - 算法转化 -> 1010(2)
 *        1010 -算法转化 -> "10"
 *     3.16进制是2进制的简写，16进制就是2进制！
 *     4.计算机硬件不支持正负号，为了解决符号问题，使用补码算法
 * 
 * 
 * @author Administrator
 *
 */
public class 数组复制扩容_排序算法_递归调用_二进制基础 {

	public static void main(String[] args) {
		// TODO 自动生成的方法存根

	}

}
