package 进制;

public class 补码 {
/**
 *   10       2
 *   -8      1000
 *   -7      1001
 *   -6      1010
 *   -5      1011 
 *   -4      1100
 *   -3      1101
 *   -2      1110
 *   -1      1111
 *    0      0000	
 *    1      0001
 *    2      0010
 *    3      0011
 *    4      0100
 *    5      0101
 *    6      0110
 *    7      0111
 *    
 * 取反加1
 * 4(0100)+1 =1011 +1 =1100
 * byte 类型 8 位补码
 * 最小值：10000000
 * 最大值:01111111
 * 
 * 
 * 
 * 
 * @param args
 */
	public static void main(String[] args) {
		// TODO 自动生成的方法存根

	}

}
